## Day 5

### ```More On Pandas```

In [1]:
#1.inital observation => info(), Descriptive, head(10)etc

````Merge Dataset````

In [2]:
#concate, Joining, Merging
# Row-wise merging, Column wise merging

In [3]:
import pandas as pd

In [4]:
#Concate
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
})

df2 = pd.DataFrame({
    "Name": ["David", "Eva", "Frank", "Grace"],
    "Age": [28, 22, 40, 31]
})

In [5]:
df3 = pd.concat([df1,df2],ignore_index=True)
df3

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eva   22
5    Frank   40
6    Grace   31

In [6]:
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
})

df2 = pd.DataFrame({
    "Name_2": ["David", "Eva", "Frank", "Grace"],
    "Age_2": [28, 22, 40, 31]
})

df4 = pd.concat([df1,df2],ignore_index=True)
df4

      Name   Age Name_2  Age_2
0    Alice  25.0    NaN    NaN
1      Bob  30.0    NaN    NaN
2  Charlie  35.0    NaN    NaN
3      NaN   NaN  David   28.0
4      NaN   NaN    Eva   22.0
5      NaN   NaN  Frank   40.0
6      NaN   NaN  Grace   31.0

In [7]:
#
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
})

df2 = pd.DataFrame({
    "Name": ["David", "Eva", "Frank", "Grace"],
    "Age": [28, 22, 40, 31]
})

df3 = pd.concat([df1,df2],ignore_index=True)
#add new col
#df3 = pd.DataFrame({"City":["Paris","London","NY","Paris","London","NY"]})
#pd.concat([df1,df2],axis=1)

In [ ]:
df1.join(df2)

In [ ]:
df1 = pd.DataFrame({
    "Age": [25, 30, 35]
},index=["Alice", "Bob", "Charlie"])


df2 = pd.DataFrame({
    "City": ["Paris","London","NY"]
},index=["Alice", "Bob", "Charlie"])

In [ ]:
#2 dataset, diff number of cols, merging based on a common index ===> Join

In [ ]:
print(df1)
print(df2)

In [ ]:
df1.join(df2)

In [ ]:
#
df1 = pd.DataFrame({
    "Age": [25, 30, 35],
    "ID": [101, 102, 103]   # hardcoded IDs
}, index=["Alice", "Bob", "Charlie"])

df2 = pd.DataFrame({
    "City": ["Paris", "London", "NY"],
    "ID": [101, 102, 103]   # hardcoded IDs
}, index=["Alice", "Bob", "Charlie"])

pd.merge(df1,df2,on="ID")

## Spotting & Taming Outliers

In [ ]:
#Remedial Measurement (Outliers)
#1. Detect
#2. Measurements-----iqr,z-score
# ----Variable Transformation (log,sqrt,box-cox)

In [ ]:
import pandas as pd
import numpy as np

# Sample data with an outlier
data = pd.Series([10, 12, 11, 13, 100, 14, 15])
Q1 = data.quantile(0.25)
Q3 = data.quantile(0.75)
IQR = Q3 - Q1
upper_bound = Q3 + 1.5 * IQR
lower_bound = Q1 - 1.5 * IQR

outliers = data[(data < lower_bound) | (data > upper_bound)]
print("Outliers:\n", outliers)

In [ ]:
#Navigating Missing Values

data = {'A': [1, 2, np.nan, 4],
 'B': [5, np.nan, 7, 8]}
df = pd.DataFrame(data)

In [ ]:
df.isnull().sum()

In [ ]:
df['A'].isnull().sum()

In [ ]:
################IMPUTATION############
## MEAN,Median,Mode ##
## MICE = Multiple ##

## Pivot Tables

In [ ]:
data = {'Region': ['East', 'West', 'East', 'West', 'East'],
 'Category': ['A', 'B', 'A', 'B', 'C'],
 'Sales': [100, 150, 120, 180, 200]}
df = pd.DataFrame(data)
df

In [ ]:
df.groupby("Region")["Sales"].mean()

In [ ]:
# Summarize Sales by Region and Category
pivot = pd.pivot_table(df, values='Sales', 
 index='Region', 
 columns='Category', 
 aggfunc='sum')
print("\nSales Pivot Table:\n", pivot)

In [10]:
!pip install seaborn

Requirement already satisfied: seaborn in d:\anaconda\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in d:\anaconda\lib\site-packages (from seaborn) (2.1.3)
Requirement already satisfied: pandas>=1.2 in d:\anaconda\lib\site-packages (from seaborn) (2.2.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in d:\anaconda\lib\site-packages (from seaborn) (3.10.0)
Requirement already satisfied: contourpy>=1.0.1 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.1)
Requirement already satisfied: cycler>=0.10 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.55.3)
Requirement already satisfied: kiwisolver>=1.3.1 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.8)
Requirement already satisfied: packaging>=20.0 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.2)
Requirement already satisfied: pillow>=8 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (11.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.0)
Requirement already satisfied: python-dateutil>=2.7 in d:\anaconda\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\anaconda\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)

In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

data = {'Feature1': [10, 20, 30, 40, 50],
 'Feature2': [2, 4, 6, 8, 10],
 'Feature3': [15, 12, 10, 8, 5]}
df = pd.DataFrame(data)

print("Correlation Matrix:\n", df.corr())

# Visualize with a heatmap
plt.figure(figsize=(6, 4))
sns.heatmap(df.corr(), annot=True, cmap='coolwarm', fmt=".2f")
plt.title('Correlation Heatmap')
plt.show()

In [ ]:
pip show seaborn

## Datetime

In [18]:
#default yy-mm-dd HH:MM:SS

dict = {
    'Time' : ['2024-12-31 10:10:10','2004-05-25 12:11:10','2025-08-28 17:51:10','2024-12-31 10:10:10'],
    'Income' : [12,15,11,14] 
}

df = pd.DataFrame(dict)
df.head()

                  Time  Income
0  2024-12-31 10:10:10      12
1  2004-05-25 12:11:10      15
2  2025-08-28 17:51:10      11
3  2024-12-31 10:10:10      14

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Time    4 non-null      object
 1   Income  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [27]:
df['New_time'] = pd.to_datetime(df["Time"])
df

                  Time  Income            New_time
0  2024-12-31 10:10:10      12 2024-12-31 10:10:10
1  2004-05-25 12:11:10      15 2004-05-25 12:11:10
2  2025-08-28 17:51:10      11 2025-08-28 17:51:10
3  2024-12-31 10:10:10      14 2024-12-31 10:10:10

In [23]:
df

                  Time  Income
0  2024-12-31 10:10:10      12
1  2004-05-25 12:11:10      15
2  2025-08-28 17:51:10      11
3  2024-12-31 10:10:10      14

In [ ]:
df.info()

In [28]:
df['New_time'].dt.month

0    12
1     5
2     8
3    12
Name: New_time, dtype: int32